import numpy as np

colormap = {
    'ref': {
        "levels": [-15, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70],
        "colorslabel": [],
        "colors": ['#00ecec', '#01a0f7', '#0000f7', '#00fe00', '#00c800', '#009000', '#fefe00',
                   '#e7c000', '#fe9000', '#fe0000', '#d20000', '#ae0000', '#fe00fe', '#9955c9'],
        "label": "dBZ",
        "units": "dBZ",
        "title": "基本反射率"
    },
    'vel': {
        "levels": [-27, -20, -15, -10, -5, -3, -1, 0, 1, 3, 5, 10, 15, 20, 27],
        "colorslabel": [],
        "colors": ['#7ee0fe', '#00e0fe', '#00b0b0', '#00fe00', '#00c400', '#008000', '#b4b4b4',
                   '#d3d3d3', '#fe0000', '#fe5858', '#feb0b0', '#fe7c00', '#fed200', '#fefe00'],
        "label": "m/s",
        "units": "m/s",
        "title": "径向速度"
    },
    'zdr': {
        "levels": [-5, -4, -3, -2, -1, 0, 0.5, 1, 1.5, 2, 2.5, 3, 4, 5, 6],
        "colorslabel": [],
        "colors": ['#00ecec', '#01a0f7', '#0000f7', '#00fe00', '#00c800', '#009000', '#fefe00', '#e7c000',
                   '#fe9000', '#fe0000', '#d20000', '#ae0000', '#fe00fe', '#9955c9'],
        "label": "dB",
        "units": "dB",
        "title": "差分反射率"
    },
    'rhv': {
        "levels": [0.5, 0.6, 0.7, 0.8, 0.85, 0.90, 0.92, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.00, 1.01],
        "colorslabel": [],
        "colors": ['#00ecec', '#01a0f7', '#0000f7', '#00fe00', '#00c800', '#009000', '#fefe00', '#e7c000',
                   '#fe9000', '#fe0000', '#d20000', '#ae0000', '#fe00fe', '#9955c9'],
        "label": "",
        "units": "",
        "title": "相关系数"
    },
    'pdp': {
        "levels": [-500, -10, 5, 10, 20, 30, 40, 60, 80, 100, 120, 150, 200, 250, 300, 360],
        "colorslabel": [],
        "colors": ['#000000', '#00ecec', '#01a0f7', '#0000f7', '#00fe00', '#00c800', '#009000', '#fefe00',
                   '#e7c000', '#fe9000', '#fe0000', '#d20000', '#ae0000', '#fe00fe', '#9955c9'],
        "label": "°",
        "units": "°",
        "title": "差分相位"
    },
    'kdp': {
        "levels": [-3, -2, -1, 0, 0.25, 0.5, 1, 1.5, 2, 3, 4, 5, 6, 7, 8],
        "colorslabel": [],
        "colors": ['#00ecec', '#01a0f7', '#0000f7', '#00fe00', '#00c800', '#009000', '#fefe00', '#e7c000',
                   '#fe9000', '#fe0000', '#d20000', '#ae0000', '#fe00fe', '#9955c9'],
        "label": "°/km",
        "units": "°/km",
        "title": "差分相移率"
    },
    'hcl': {
        "levels": [-0.5, 0.5, 1.5, 2.5, 3.5, 4.5, 5.5, 6.5, 7.5, 8.5, 9.5],
        "colorslabel": ['地物', '湍流', '干雪', '湿雪', '冰晶', '霰', '大滴', '雨', '大雨', '雹', ' '],
        "colors": ['#787878', '#a0a0a0', '#00d2ff', '#0090ff', '#ffc8c8', '#d28282', '#ffc832', '#02ff64',
                   '#00be00', '#ff0000'],
        "label": "",
        "units": "",
        "title": "水凝物相态"
    },
    'scw': {
        "levels": [-0.5, 3.5, 5.5, 8.5],
        "colorslabel": ['非过冷水', '过冷水', ' '],
        "colors": ['#a0a0a0', '#ff0000', '#a0a0a0'],
        "label": "",
        "units": "",
        "title": "过冷水"
    },
    'ccl': {
        "levels": [0, 0.9, 2],
        "colorslabel": ['对流云', '层状云', ' '],
        "colors": ['#ff3c3c', '#3c3c78'],
        "label": "",
        "units": "",
        "title": "对流云层状云"
    },
    'crf': {
        "levels": (-15, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70),
        "colorslabel": [],
        "colors": ['#00ecec', '#01a0f7', '#0000f7', '#00fe00', '#00c800', '#009000', '#fefe00',
                   '#e7c000', '#fe9000', '#fe0000', '#d20000', '#ae0000', '#fe00fe', '#9955c9'],
        "label": "dBZ",
        "units": "dBZ",
        "title": "组合反射率"
    },
    'etp': {
        "levels": [0, 2, 3, 5, 6, 8, 9, 11, 12, 14, 15, 17, 18, 20.0],
        "colorslabel": [],
        "colors": ['#000000', '#0000f7', '#00fe00', '#00c800', '#009000', '#fefe00',
                   '#e7c000', '#fe9000', '#fe0000', '#d20000', '#ae0000', '#fe00fe', '#9955c9'],
        # '#00ecec', '#01a0f7',
        "label": "km",
        "units": "km",
        "title": "回波顶高"
    },
    # 需要确认rgb顺序
    'wid': {
        "levels": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
        "colorslabel": [],
        "colors": ['#D8D8D8', '#0000F6', '#01A0F6', '#00ECEC', '#01FF00', '#00C800', '#019000',
                   '#FFFF00', '#E7C000', '#FF9000', '#FF0000', '#D60000', '#C00000', '#FF00F0',
                   '#77007D'],
        "label": "m/s",
        "units": "m/s",
        "title": "速度谱宽"
    },
    'vil': {
        "levels": [1, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75],
        "colorslabel": [],
        "colors": ['#9C9C9C', '#767676', '#FAAAAA', '#E68C8C', '#C87070', '#00FA90',
                   '#00BA00', '#FEFE70', '#D0D060', '#FE6060', '#DA0000', '#AE0000', '#0000FE',
                   '#000000', '#E600FE'],
        "label": "kg/m${^3}$",
        "units": "kg/m³",
        "title": "垂直累积液态水"
    },
    'snr': {
        "levels": [0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70],
        "colorslabel": [],
        "colors": ['#6CE8E9', '#479EF0', '#0100ED', '#75FA4B', '#5AC639', '#3F8D28', '#FEFD54', '#E2C141',
                   '#EF9536', '#EA3324', '#C1281B', '#A02013', '#E833F5', '#8F58C2'],
        "label": "dB",
        "units": "dB",
        "title": "信噪比"
    },
    'w': {
        "levels": [-10, -8, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 8, 10],
        "colorslabel": [],
        "colors": ['#313695', '#3e60aa', '#5588be', '#74add1', '#99cae1', '#bde2ee', '#e0f3f8', '#fafde9',
                   '#fff5af', '#fee090', '#fdbf71', '#fa9857', '#f46d43', '#e14430', '#c62027', '#a50026'],
        "label": "m/s",
        "units": "m/s",
        "title": "垂直风速"
    },
    'area': {
        "levels": None,
        "colors": None,
        "label": " ",
        "units": " ",
    },
    'CTH': {'colors': ['#020382', '#0000d4', '#0021fc', '#0179ff', '#03cfff', '#1effdd', '#76ff8d',
                       '#cffe32', '#ffe001', '#fe8d01', '#fd3100', '#dd0103'],
            'levels': [1, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20],
            'unit': 'km',
            'label': '云顶高度'
            },
    'CTT': {'colors': ['#0000ff', '#1919ff', '#3333ff', '#4d4dff', '#6666ff', '#8080ff', '#9999ff',
                       '#b3b3ff', '#ccccff', '#e6e6ff', '#ffffff', '#ffe6e6', '#ffcccc', '#ffb3b3',
                       '#ff9999', '#ff8080', '#ff6666', '#ff4d4d', '#ff3333', '#ff1919', '#ff0000'],
            'levels': np.arange(-50, 55, 5),
            'unit': '℃',
            'label': '云顶温度'
            },
    'NOMChannel01': {'colors': None,
                     'levels': [0, 1],
                     'cmaps': 'gray',
                     'label': '可见光通道'
                     },
    'NOMChannel09': {'colors': ['#231814', '#3f3939', '#4a4947', '#585657', '#666465', '#717171', '#7e7e7e',
                                '#898989', '#959595', '#9f9f9f', '#ababab', '#b6b6b6', '#c0c0c0', '#c9c9c9',
                                '#d3d3d3', '#dddddd', '#e7e7e7', '#efefef', '#f7f7f7', '#fdfdfd'][::-1],
                     'levels': [190, 250],
                     'cmaps': 'gray_r',
                     'label': '水汽通道'
                     },
    'NOMChannel12': {'colors': None,
                     'levels': [240, 300],
                     'cmaps': 'gray_r',
                     'label': '红外通道'},
    'dm': {
        "levels": [0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0, 5.5, 6.0, 6.5],
        "colors": ["#00ecec", "#01a0f6", "#0000f6", "#00ff00", "#3bc83b", "#009000", "#ffff00",
                   "#e7c000", "#ff9000", "#ff6633", "#ff5757", "#ff0000", "#c00000"],
        "colorslabel": [],
        "label": "mm",
        "titele": "粒子大小"
    },
    'nw': {
        "levels": [0, 1, 10, 50, 100, 500, 1000, 5000, 10000, 50000, 100000, 500000, 1000000, 5000000],
        "colors": ["#00ecec", "#01a0f6", "#0000f6", "#00ff00", "#3bc83b", "#009000", "#ffff00",
                   "#e7c000", "#ff9000", "#ff6633", "#ff5757", "#ff0000", "#c00000"],
        "colorslabel": [],
        "label": "mm${^-}$${^1}$m${^-}$${^3}$",
        "title": "粒子数密度"
    },
    'rainrate': {
        "levels": [-1, 0.0, 0.5, 1.0, 2.0, 3.0, 4.0, 6.0, 8.0, 10.0, 12.0, 15.0, 20.0, 25.0, 30.0, 35.0,
                   40.0, 45.0, 50.0, 60.0, 80.0, 100.0],
        "colors": ["#ffffff", "#a6caf0", "#60c0c0", "#00c0c0", "#20a0c0", "#4060c0", "#204080", "#0000c0",
                   "#008000", "#40a000", "#20c000", "#40e040", "#c0c000", "#e0e000", "#ffff00", "#e0a0c0",
                   "#e08080", "#e06040", "#ff0000", "#ff00ff", "#800080"],
        "colorslabel": [],
        "label": "mm/h",
        "unit": "mm/h",
        "title": "降水强度"
    }
}

c_colormap = {'sw': [0, 15, 'jet'],
              'vel': [-20, 20, 'jet'],
              'ref': [-40, 40, 'jet']}
